src/Catalogs/Gists/Gists.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Gists</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Открытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеБезТегов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Усечение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяБезРасширения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тело</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Язык</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Усечение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Gists/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Элементы.Открытый.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Автор = Пользователи.ТекущийПользователь();
		
		Объект.Файлы.Добавить();
		
	КонецЕсли;
	
	Для Каждого Элемент Из Объект.Файлы Цикл
		ДобавитьФайлНаФорму(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	&ОписаниеБезТегов КАК Наименование
					   |
					   |ОБЪЕДИНИТЬ ВСЕ
					   |
					   |ВЫБРАТЬ
					   |	""#"" + Теги.Наименование
					   |ИЗ
					   |	Справочник.Теги КАК Теги
					   |ГДЕ
					   |	Теги.Ссылка В(&Ссылка)";
		Запрос.УстановитьПараметр("ОписаниеБезТегов", СокрЛП(ТекущийОбъект.ОписаниеБезТегов));
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Теги.ВыгрузитьКолонку(0));
		ТекущийОбъект.Описание = СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0), " ");
		
		Реквизиты = Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты;
		Для Каждого Строка Из ТекущийОбъект.Файлы Цикл
			
			Ключ = "Файл" + Формат(Строка.НомерСтроки, "ЧГ=");
			Для Каждого Реквизит Из Реквизиты Цикл
				Строка[Реквизит.Имя] = ЭтаФорма[Ключ + Реквизит.Имя];						
			КонецЦикла;
			
		КонецЦикла;

		Справочники.Gists.ЗаписатьGist(ТекущийОбъект.Идентификатор, ТекущийОбъект);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Реквизиты = Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты;
	Для Каждого Строка Из Объект.Файлы Цикл
		Ключ = "Файл" + Формат(Строка.НомерСтроки, "ЧГ=");
		Для Каждого Элемент Из Реквизиты Цикл
			ЭтаФорма[Ключ + Элемент.Имя] = Строка[Элемент.Имя];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизитыКопия = ОбщегоНазначения.СкопироватьРекурсивно(ПроверяемыеРеквизиты);
	ПроверяемыеРеквизиты.Очистить();
	Для Каждого Элемент Из ПроверяемыеРеквизитыКопия Цикл 
		Если Не СтрНачинаетсяС(Элемент, "Файл") Тогда 
			ПроверяемыеРеквизиты.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
		
	Для Номер = 1 По Объект.Файлы.Количество() Цикл
		Ключ = "Файл" + Формат(Номер, "ЧГ=");
		ПроверяемыеРеквизиты.Добавить(Ключ + "ИмяБезРасширения");
		ПроверяемыеРеквизиты.Добавить(Ключ + "Расширение");
		ПроверяемыеРеквизиты.Добавить(Ключ + "Тело");	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура АдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.Адрес);
	
КонецПроцедуры

#Область Подключаемый_Файл

&НаКлиенте
Процедура Подключаемый_ФайлИмяПриИзменении(Элемент)

	Если СтрЗаканчиваетсяНа(Элемент.Имя, "ИмяБезРасширения") Тогда
		ИмяРеквизита = "ИмяБезРасширения";
	ИначеЕсли СтрЗаканчиваетсяНа(Элемент.Имя, "Расширение") Тогда
		ИмяРеквизита = "Расширение";
	Иначе
		ВызватьИсключение Элемент.Имя;
	КонецЕсли;
	Ключ = СтрЗаменить(Элемент.Имя, ИмяРеквизита, "");

	ЭтаФорма[Ключ + "Имя"] = ЭтаФорма[Ключ + "ИмяБезРасширения"] + ?(ПустаяСтрока(ЭтаФорма[Ключ + "Расширение"]), "",
		".") + ЭтаФорма[Ключ + "Расширение"];

	Элементы["Группа" + Ключ].ЗаголовокСвернутогоОтображения = ЭтаФорма[Ключ + "Имя"];

	Имя = Новый Массив;
	Для Номер = 1 По Объект.Файлы.Количество() Цикл
		Имя.Добавить(ЭтаФорма[СтрШаблон("Файл%1Имя", Номер)]);
	КонецЦикла;
	Объект.Наименование = СтрСоединить(Имя, ", ");

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ФайлАдресНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ПустаяСтрока(ЭтаФорма[Элемент.Имя]) Тогда
		ЗапуститьПриложение(ЭтаФорма[Элемент.Имя]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	ДобавитьФайлНаФорму(Объект.Файлы.Добавить().ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	УдалитьФайлСФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьФайлНаФорму(Знач Строка)

	Если ТипЗнч(Строка) = Тип("Число") Тогда 
		Строка = Объект.Файлы.НайтиПоИдентификатору(Строка);
	КонецЕсли;
	
	Ключ = "Файл" + Формат(Строка.НомерСтроки, "ЧГ=");
	
	Реквизиты = Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты;
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из Реквизиты Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Ключ + Элемент.Имя, Элемент.Тип,, Элемент.Синоним, Истина));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Для Каждого Элемент Из Реквизиты Цикл 
		ЭтаФорма[Ключ + Элемент.Имя] = Строка[Элемент.Имя];
	КонецЦикла;
	
//	1
	Корень = Элементы.Вставить("Группа" + Ключ, Тип("ГруппаФормы"), Элементы.ГруппаФайлы,
		Элементы.ГруппаФайлыКоманднаяПанель);
	Корень.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Корень.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Корень.Заголовок = " ";
	Корень.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Корень.ЗаголовокСвернутогоОтображения = Строка.Имя;
	Корень.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Корень.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
//	1.1
	Шапка = Элементы.Добавить(Корень.Имя + "Шапка", Тип("ГруппаФормы"), Корень);
	Шапка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Шапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	Шапка.ОтображатьЗаголовок = Ложь;
//	1.1.1
	Элемент = Элементы.Добавить(Ключ + "ИмяБезРасширения", Тип("ПолеФормы"), Шапка);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "ИмяБезРасширения";
	Элемент.Заголовок = "Имя";
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ФайлИмяПриИзменении");
//	1.1.2
	Элемент = Элементы.Добавить(Ключ + "Расширение", Тип("ПолеФормы"), Шапка);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Расширение";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 10;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ФайлИмяПриИзменении");
//	1.1.3
	Элемент = Элементы.Добавить(Ключ + "Адрес", Тип("ПолеФормы"), Шапка);
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.Гиперссылка = Истина;
	Элемент.ПутьКДанным = Ключ + "Адрес";
	Элемент.УстановитьДействие("Нажатие", "Подключаемый_ФайлАдресНажатие");
//	1.2
	Элемент = Элементы.Добавить(Ключ + "Тело", Тип("ПолеФормы"), Корень);
	Элемент.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
	Элемент.ПутьКДанным = Ключ + "Тело";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
//	1.3
	Свойства = Элементы.Добавить(Корень.Имя + "Свойства", Тип("ГруппаФормы"), Корень);
	Свойства.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Свойства.Заголовок = "Свойства";
	Свойства.ШрифтЗаголовка = Новый Шрифт(,,,,,,, 8);
	Свойства.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Свойства.Скрыть();
	Свойства.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
//	1.3.1
	Элемент = Элементы.Добавить(Ключ + "Тип", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Тип";
	Элемент.ТолькоПросмотр = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 10;		
//	1.3.2
	Элемент = Элементы.Добавить(Ключ + "Язык", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Язык";
	Элемент.ТолькоПросмотр = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 10;
//	1.3.3
	Элемент = Элементы.Добавить(Ключ + "Размер", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = Ключ + "Размер";
	Элемент.ТолькоПросмотр = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина = 5;
//	1.3.4
	Элемент = Элементы.Добавить(Ключ + "Усечение", Тип("ПолеФормы"), Свойства);
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = Ключ + "Усечение";
	Элемент.ТолькоПросмотр = Истина;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлСФормы()
	
	Корень = ПолучитьКорень(ЭтаФорма.ТекущийЭлемент);
	Если Корень = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Ключ = Сред(Корень.Имя, 7);
	
	Элементы.Удалить(Корень);
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого Элемент Из Метаданные.Справочники.Gists.ТабличныеЧасти.Файлы.Реквизиты Цикл
		УдаляемыеРеквизиты.Добавить(Ключ + Элемент.Имя);
	КонецЦикла;
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	Объект.Файлы.Удалить(Число(Сред(Ключ, 5)) - 1);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКорень(Элемент)
	
	Если Элемент = Неопределено Тогда 
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы") И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(Элемент.Имя, "ГруппаФайл", "")) Тогда 
		Возврат Элемент;
		
	Иначе 
		Возврат ПолучитьКорень(Элемент.Родитель);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
